app/controllers/admin_controller.rb

  def register
    ActiveRecord::Base.transaction do
      admin = Admin.new(admin_params)
      if admin.save
        preference = Preference.create(preferable: admin)
---
INSERT INTO "admins" ("name", "email", "password", "avator", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
INSERT INTO "preferences" ("preference1", "preference2", "preference3", "preference4", "preference5", "created_at", "updated_at", "preferable_type", "preferable_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def login
    admin = Admin.find_by(name: params[:name])
---
SELECT "admins".* FROM "admins" WHERE "admins"."name" = ? LIMIT ?  [["name", "高悠然"], ["LIMIT", 1]]

  def find_by_id
    admin = Admin.find_by(id: params[:id])
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def delete_by_id
    admin = Admin.find_by(id: params[:id])
    if admin
      admin.destroy
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 2]]

  def update_by_id
    admin = Admin.find_by(id: params[:id])
    if admin
      admin.update(admin_params)
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "admins" SET "email" = ?, "updated_at" = ?, "password_digest" = ? WHERE "admins"."id" = ?  [["email", "[FILTERED]"], ["updated_at", "2024-10-19 12:36:44.938204"], ["password_digest", "[FILTERED]"], ["id", 4]]

  def update_preference_by_id
    perference = Preference.find_by(preferable_type: 'Admin', preferable_id: params[:id])
    if perference
      perference.update(update_preference_by_id_params)
---
SELECT "preferences".* FROM "preferences" WHERE "preferences"."preferable_type" = ? AND "preferences"."preferable_id" = ? LIMIT ?  [["preferable_type", "Admin"], ["preferable_id", 4], ["LIMIT", 1]]
UPDATE "preferences" SET "preference1" = ?, "preference2" = ?, "updated_at" = ? WHERE "preferences"."id" = ?  [["preference1", "泡面"], ["preference2", "拌饭"], ["updated_at", "2024-10-19 13:43:57.862042"], ["id", 12]]