app/controllers/announcement_controller.rb

  def post
    if Admin.find_by(id: params[:publisher])
      announcement = Announcement.new(announcement_params)
      if announcement.save
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "announcements" ("date", "content", "publisher", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["date", nil], ["content", "杜启嵘是真强"], ["publisher", 2], ["created_at", "2024-10-19 09:38:15.749354"], ["updated_at", "2024-10-19 09:38:15.749354"]]

  def find_by_id
    announcement = Announcement.find_by(id: params[:id])
---
SELECT "announcements".* FROM "announcements" WHERE "announcements"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def delete_by_id
    announcement = Announcement.find_by(id: params[:id])
    if announcement
      announcement.destroy
---
SELECT "announcements".* FROM "announcements" WHERE "announcements"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "announcements" WHERE "announcements"."id" = ?  [["id", 1]]