app/controllers/business_controller.rb

INSERT INTO "businesses" ("name", "tag", "score", "email", "password", "avator", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
INSERT INTO "preferences" ("preference1", "preference2", "preference3", "preference4", "preference5", "created_at", "updated_at", "preferable_type", "preferable_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
INSERT INTO "tags" ("tag1", "tag2", "tag3", "tag4", "tag5", "created_at", "updated_at", "business_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["tag1", nil], ["tag2", nil], ["tag3", nil], ["tag4", nil], ["tag5", nil], ["created_at", "2024-10-19 08:06:20.530185"], ["updated_at", "2024-10-19 08:06:20.530185"], ["business_id", 3]]
---
  def register
    ActiveRecord::Base.transaction do
      business = Business.new(business_params)
      if business.save
        preference = Preference.create(preferable: business) # 选择外键为business
        tag = Tag.create

SELECT "businesses".* FROM "businesses" WHERE "businesses"."name" = ? LIMIT ?  [["name", "麻辣烫"], ["LIMIT", 1]]
SELECT "tags".* FROM "tags" WHERE "tags"."business_id" = ? LIMIT ?  [["business_id", 3], ["LIMIT", 1]]
---
  def login
    business = Business.find_by(name: params[:name])
    if business&.authenticate(params[:password])
      preference = Preference.find_by(preferable: business)
      tag = Tag.find_by(business: business)

SELECT "businesses".* FROM "businesses" WHERE "businesses"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "tags".* FROM "tags" WHERE "tags"."business_id" = ? LIMIT ?  [["business_id", 3], ["LIMIT", 1]]
---
  def find_by_id
    business = Business.find_by(id: params[:id])
    if business
      preference = Preference.find_by(preferable: business)
      tag = Tag.find_by(business: business)

SELECT "businesses".* FROM "businesses" WHERE "businesses"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "businesses" WHERE "businesses"."id" = ?  [["id", 3]]
---
  def delete_by_id
    business = Business.find_by(id: params[:id])
    if business
      business.destroy

SELECT "businesses".* FROM "businesses" WHERE "businesses"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "businesses" SET "email" = ?, "updated_at" = ?, "password_digest" = ? WHERE "businesses"."id" = ?  [["email", "[FILTERED]"], ["updated_at", "2024-10-19 12:40:39.503514"], ["password_digest", "[FILTERED]"], ["id", 5]]
---
  def update_by_id
    business = Business.find_by(id: params[:id])
    if business
      business.update(business_params)

SELECT "preferences".* FROM "preferences" WHERE "preferences"."preferable_type" = ? AND "preferences"."preferable_id" = ? LIMIT ?  [["preferable_type", "Business"], ["preferable_id", 4], ["LIMIT", 1]]
UPDATE "preferences" SET "preference1" = ?, "updated_at" = ? WHERE "preferences"."id" = ?  [["preference1", "川菜"], ["updated_at", "2024-10-19 13:54:40.311280"], ["id", 13]]
---
  def update_preference_by_id
    preference = Preference.find_by(preferable_type: 'Business', preferable_id: params[:id])
    if preference
      preference.update(update_preference_by_id_params)

SELECT "tags".* FROM "tags" WHERE "tags"."business_id" = ? LIMIT ?  [["business_id", 4], ["LIMIT", 1]]
UPDATE "tags" SET "tag2" = ?, "updated_at" = ? WHERE "tags"."id" = ?  [["tag2", "便利店"], ["updated_at", "2024-10-19 14:08:49.318273"], ["id", 4]]
---
  def update_tag_by_id
    tag = Tag.find_by(business_id: params[:id]) # tag belongs to business, so use business_id to find tag
    puts
    if tag
      tag.update(update_tag_by_id_params)