app/controllers/commodity_controller.rb

INSERT INTO "commodities" ("name", "price", "score", "introduction", "business_id", "homepage", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def register
    ActiveRecord::Base.transaction do
      commodity = Commodity.new(commodity_params_register)
      commodity.score = 0
      commodity.rating_count = 0
      commodity.url = 'http://47.93.172.156:8081/uploads/NMB.jpg'
      if commodity.save

SELECT "commodities".* FROM "commodities" WHERE "commodities"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def find_by_id
    commodity = Commodity.find_by(id: params[:id])

SELECT "commodities".* FROM "commodities" WHERE "commodities"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "commodities" SET "name" = ?, "price" = ?, "introduction" = ?, "updated_at" = ? WHERE "commodities"."id" = ?  [["name", "薯片"], ["price", 6.0], ["introduction", "薯片是一种零食"], ["updated_at", "2024-10-19 13:00:03.378567"], ["id", 4]]
---
  def update_by_id
    commodity = Commodity.find_by(id: params[:id]) # params是整体的传参hash
    if commodity
      commodity.update(commodity_params_update)