app/controllers/comment_controller.rb

  def post
    if (params[:publisher_type] == 'User' && User.find_by_id(params[:publisher])) ||
       (params[:publisher_type] == 'Business' && Business.find_by_id(params[:publisher])) ||
       (params[:publisher_type] == 'Admin' && Admin.find_by_id(params[:publisher]))
      if Post.find_by_id(params[:post_id])
        comment = Comment.new(comment_params)
        comment.likes = 0
        if comment.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("post_id", "publisher", "publisher_type", "date", "content", "likes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def find_by_post_id
    comments = Comment.where(post_id: params[:id])
    if comments.any?
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def delete_by_id
    comment = Comment.find_by_id(params[:id])
    if comment
      comment.destroy
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]