app/controllers/post_controller.rb

SELECT "admins".* FROM "admins" WHERE "admins"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "posts" ("publisher", "publisher_type", "date", "likes", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["publisher", 3], ["publisher_type", "User"], ["date", "2025-03-31"], ["likes", 0], ["content", "听泉鉴宝"], ["created_at", "2024-10-19 09:22:19.348910"], ["updated_at", "2024-10-19 09:22:19.348910"]]
---
  def post
    if (params[:publisher_type] == 'User' && User.find_by(id: params[:publisher])) ||
       (params[:publisher_type] == 'Admin' && Admin.find_by(id: params[:publisher])) ||
       (params[:publisher_type] == 'Business' && Business.find_by(id: params[:publisher]))
      post = Post.new(post_params)
      post.likes = 0
      if post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def find_by_id
    post = Post.find_by(id: params[:id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
  def delete_by_id
    post = Post.find_by(id: params[:id])
    if post
      post.destroy