app/controllers/user_controller.rb

  def register
    ActiveRecord::Base.transaction do
      user = User.new(user_params)
      if user.save
        preference = Preference.create(preferable: user)
---
INSERT INTO "users" ("name", "email", "password", "avator", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "dqr"], ["email", "[FILTERED]"], ["password", "[FILTERED]"], ["avator", nil], ["created_at", "2024-10-19 02:57:23.201665"], ["updated_at", "2024-10-19 02:57:23.201665"]]
INSERT INTO "preferences" ("preference1", "preference2", "preference3", "preference4", "preference5", "created_at", "updated_at", "preferable_type", "preferable_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def login
    user = User.find_by(name: params[:name])
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "杜启嵘"], ["LIMIT", 1]]

  def find_by_id
    user = User.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def delete_by_id
    user = User.find_by(id: params[:id])
    if user
      user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]

  def update_by_id
    user = User.find_by(id: params[:id])
    if user
      user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "updated_at" = ?, "password_digest" = ? WHERE "users"."id" = ?  [["email", "[FILTERED]"], ["updated_at", "2024-10-19 12:32:32.209793"], ["password_digest", "[FILTERED]"], ["id", 4]]

  def update_preference_by_id # by user id
    preference = Preference.find_by(preferable_type: 'User', preferable_id: params[:id])
    if preference
      preference.update(update_preference_by_id_params)
---
SELECT "preferences".* FROM "preferences" WHERE "preferences"."preferable_type" = ? AND "preferences"."preferable_id" = ? LIMIT ?  [["preferable_type", "User"], ["preferable_id", 5], ["LIMIT", 1]]
UPDATE "preferences" SET "preference1" = ?, "preference2" = ?, "preference3" = ?, "updated_at" = ? WHERE "preferences"."id" = ?  [["preference1", "川菜"], ["preference2", "东北菜"], ["preference3", "鲁菜"], ["updated_at", "2024-10-19 14:15:29.502357"], ["id", 11]]